flume_tasks/cases/task4_cylinder_current/system/sampleSurface
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleSurface;
}

type            surfaces;
libs            ("libsampling.so");
writeControl    writeTime;
writeInterval   1;
surfaceFormat   raw;

fields          (alpha.water);

surfaces
(
    freeSurface
    {
        type        isoSurface;
        isoField    alpha.water;
        isoValue    0.5;
        interpolate true;
    }
);
